In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [5]:
df= sns.load_dataset('tips')

In [6]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
df.isna().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [9]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [11]:
df['sex'].nunique()

2

In [12]:
df['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [18]:
from sklearn.preprocessing import OneHotEncoder
encoder= OneHotEncoder() # creating the intances

In [20]:
encoded=encoder.fit_transform(df[['sex']]).toarray()

In [22]:
encoded_df= pd.DataFrame(encoded, columns= encoder.get_feature_names_out())

In [23]:
encoded_df.head()

   sex_Female  sex_Male
0         1.0       0.0
1         0.0       1.0
2         0.0       1.0
3         0.0       1.0
4         1.0       0.0

In [33]:
new_df=pd.concat([df,encoded_df], axis= 1)

In [34]:
new_df.head()

   total_bill   tip     sex smoker  day    time  size  sex_Female  sex_Male
0       16.99  1.01  Female     No  Sun  Dinner     2         1.0       0.0
1       10.34  1.66    Male     No  Sun  Dinner     3         0.0       1.0
2       21.01  3.50    Male     No  Sun  Dinner     3         0.0       1.0
3       23.68  3.31    Male     No  Sun  Dinner     2         0.0       1.0
4       24.59  3.61  Female     No  Sun  Dinner     4         1.0       0.0

In [35]:
new_df.drop('sex', axis=1, inplace=True)

In [36]:
new_df.head()

   total_bill   tip smoker  day    time  size  sex_Female  sex_Male
0       16.99  1.01     No  Sun  Dinner     2         1.0       0.0
1       10.34  1.66     No  Sun  Dinner     3         0.0       1.0
2       21.01  3.50     No  Sun  Dinner     3         0.0       1.0
3       23.68  3.31     No  Sun  Dinner     2         0.0       1.0
4       24.59  3.61     No  Sun  Dinner     4         1.0       0.0

In [37]:
new_df['day'].unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [38]:
new_df['day'].nunique()

4

In [39]:
new_df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [44]:
encoded=encoder.fit_transform(df[['day']]).toarray()

In [45]:
encoded_df=pd.DataFrame(encoded, columns= encoder.get_feature_names_out())

In [46]:
encoded_df.head()

   day_Fri  day_Sat  day_Sun  day_Thur
0      0.0      0.0      1.0       0.0
1      0.0      0.0      1.0       0.0
2      0.0      0.0      1.0       0.0
3      0.0      0.0      1.0       0.0
4      0.0      0.0      1.0       0.0

In [48]:
new_df= pd.concat([new_df, encoded_df], axis=1)

In [49]:
new_df.head()

,total_bill,tip,smoker,day,time,size,sex_Female,sex_Male,day_Fri,day_Sat,day_Sun,day_Thur
0,16.99,1.01,No,Sun,Dinner,2,1.0,0.0,0.0,0.0,1.0,0.0
1,10.34,1.66,No,Sun,Dinner,3,0.0,1.0,0.0,0.0,1.0,0.0
2,21.01,3.50,No,Sun,Dinner,3,0.0,1.0,0.0,0.0,1.0,0.0
3,23.68,3.31,No,Sun,Dinner,2,0.0,1.0,0.0,0.0,1.0,0.0
4,24.59,3.61,No,Sun,Dinner,4,1.0,0.0,0.0,0.0,1.0,0.0

In [50]:
new_df.drop('day', axis=1, inplace=True)

In [51]:
new_df.head()

,total_bill,tip,smoker,time,size,sex_Female,sex_Male,day_Fri,day_Sat,day_Sun,day_Thur
0,16.99,1.01,No,Dinner,2,1.0,0.0,0.0,0.0,1.0,0.0
1,10.34,1.66,No,Dinner,3,0.0,1.0,0.0,0.0,1.0,0.0
2,21.01,3.50,No,Dinner,3,0.0,1.0,0.0,0.0,1.0,0.0
3,23.68,3.31,No,Dinner,2,0.0,1.0,0.0,0.0,1.0,0.0
4,24.59,3.61,No,Dinner,4,1.0,0.0,0.0,0.0,1.0,0.0

In [54]:
new_df['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [56]:
new_df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [57]:
encoded= encoder.fit_transform(new_df[['time']]).toarray()

In [58]:
encoded_df= pd.DataFrame(encoded, columns= encoder.get_feature_names_out())

In [59]:
new_df= pd.concat([new_df, encoded_df], axis=1)

In [60]:
new_df.head()

,total_bill,tip,smoker,time,size,sex_Female,sex_Male,day_Fri,day_Sat,day_Sun,day_Thur,time_Dinner,time_Lunch
0,16.99,1.01,No,Dinner,2,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
1,10.34,1.66,No,Dinner,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
2,21.01,3.50,No,Dinner,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
3,23.68,3.31,No,Dinner,2,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
4,24.59,3.61,No,Dinner,4,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0

In [61]:
new_df.drop('time', axis=1, inplace=True)

In [62]:
new_df.head()

,total_bill,tip,smoker,size,sex_Female,sex_Male,day_Fri,day_Sat,day_Sun,day_Thur,time_Dinner,time_Lunch
0,16.99,1.01,No,2,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0
1,10.34,1.66,No,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
2,21.01,3.50,No,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
3,23.68,3.31,No,2,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
4,24.59,3.61,No,4,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0

In [63]:
new_df['smoker'].unique()

['No', 'Yes']
Categories (2, object): ['Yes', 'No']

In [64]:
new_df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [65]:
encoded= encoder.fit_transform(new_df[['smoker']]).toarray()

In [68]:
encoded_df=pd.DataFrame(encoded, columns= encoder.get_feature_names_out())

In [71]:
new_df=pd.concat([new_df, encoded_df], axis=True)

In [72]:
new_df.head()

,total_bill,tip,smoker,size,sex_Female,sex_Male,day_Fri,day_Sat,day_Sun,day_Thur,time_Dinner,time_Lunch,smoker_No,smoker_Yes
0,16.99,1.01,No,2,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
1,10.34,1.66,No,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
2,21.01,3.50,No,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
3,23.68,3.31,No,2,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
4,24.59,3.61,No,4,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0

In [73]:
new_df.drop('smoker',axis=1, inplace= True)

In [74]:
new_df.head()

,total_bill,tip,size,sex_Female,sex_Male,day_Fri,day_Sat,day_Sun,day_Thur,time_Dinner,time_Lunch,smoker_No,smoker_Yes
0,16.99,1.01,2,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
1,10.34,1.66,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
2,21.01,3.50,3,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
3,23.68,3.31,2,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0
4,24.59,3.61,4,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,1.0,0.0